Tekla Open API Reference for Tekla Structures 2025
Polycurve Methods
The Polycurve type exposes the following members.
Methods
Name | Description
Clone
 Creates a deep copy of the polycurve
Equals
 Determines whether the polycurve equals another polycurve This function only checks for equality among polycurves
GetEnumerator
 This method implements the IEnumerable interface
Top
See Also
Reference
Polycurve Class
Tekla.Structures.Geometry3d Namespace